$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.3',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '10.4.0',
          'Headers' => {
                         'secp256k1.h' => 1,
                         'secp256k1_ecdh.h' => 1,
                         'secp256k1_extrakeys.h' => 1,
                         'secp256k1_preallocated.h' => 1,
                         'secp256k1_recovery.h' => 1,
                         'secp256k1_schnorrsig.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libsecp256k1.so.1.0.0',
          'LibraryVersion' => '0.2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'secp256k1.c' => 1
                       },
          'SymbolInfo' => {
                            '10340' => {
                                         'Header' => 'secp256k1_extrakeys.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx',
                                                               'type' => '470'
                                                             },
                                                      '1' => {

                                                      'secp256k1_ecdsa_recoverable_signature_serialize_compact' => 1,
                                                      'secp256k1_ecdsa_sign' => 1,
                                                      'secp256k1_ecdsa_sign_recoverable' => 1,
                                                      'secp256k1_ecdsa_signature_normalize' => 1,
                                                      'secp256k1_ecdsa_signature_parse_compact' => 1,
                                                      'secp256k1_ecdsa_signature_parse_der' => 1,
                                                      'secp256k1_ecdsa_signature_serialize_compact' => 1,
                                                      'secp256k1_ecdsa_signature_serialize_der' => 1,
                                                      'secp256k1_ecdsa_verify' => 1,
                                                      'secp256k1_keypair_create' => 1,
                                                      'secp256k1_keypair_pub' => 1,
                                                      'secp256k1_keypair_sec' => 1,
                                                      'secp256k1_keypair_xonly_pub' => 1,
                                                      'secp256k1_keypair_xonly_tweak_add' => 1,
                                                      'secp256k1_nonce_function_bip340' => -8,
                                                      'secp256k1_nonce_function_default' => -8,
                                                      'secp256k1_nonce_function_rfc6979' => -8,
                                                      'secp256k1_schnorrsig_sign' => 1,
                                                      'secp256k1_schnorrsig_sign32' => 1,
                                                      'secp256k1_schnorrsig_sign_custom' => 1,
                                                      'secp256k1_schnorrsig_verify' => 1,
                                                      'secp256k1_scratch_space_create' => 1,
                                                      'secp256k1_scratch_space_destroy' => 1,
                                                      'secp256k1_selftest' => 1,
                                                      'secp256k1_tagged_sha256' => 1,
                                                      'secp256k1_xonly_pubkey_cmp' => 1,
                                                      'secp256k1_xonly_pubkey_from_pubkey' => 1,
                                                      'secp256k1_xonly_pubkey_parse' => 1,
                                                      'secp256k1_xonly_pubkey_serialize' => 1,
                                                      'secp256k1_xonly_pubkey_tweak_add' => 1,
                                                      'secp256k1_xonly_pubkey_tweak_add_check' => 1
                                                    }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100' => {
                                     'BaseType' => '117',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '50',
                                     'Name' => 'secp256k1_context',
                                     'Size' => '208',
                                     'Type' => 'Typedef'
                                   },
                          '10334' => {
                                       'BaseType' => '312',
                                       'Name' => 'secp256k1_pubkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '112' => {
                                     'BaseType' => '100',
                                     'Name' => 'secp256k1_context const',
                                     'Size' => '208',
                                     'Type' => 'Const'
                                   },
                          '117' => {
                                     'Line' => '62',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'ecmult_gen_ctx',
                                                          'offset' => '0',
                                                          'type' => '2474'
                                                        },
                                                 '1' => {
                                                          'name' => 'illegal_callback',
                                                          'offset' => '360',
                                                          'type' => '1375'
                                                        },
                                                 '2' => {
                                                          'name' => 'error_callback',
                                                          'offset' => '388',
                                                          'type' => '1375'
                                                        },
                                                 '3' => {
                                                          'name' => 'declassify',
                                                          'offset' => '512',
                                                          'type' => '83'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_context_struct',
                                     'PrivateABI' => 1,
                                     'Size' => '208',
                                     'Source' => 'secp256k1.c',
                                     'Type' => 'Struct'
                                   },
                          '11745' => {
                                       'BaseType' => '324',
                                       'Name' => 'secp256k1_pubkey const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11751' => {
                                       'BaseType' => '11745',
                                       'Name' => 'secp256k1_pubkey const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1353' => {
                                      'BaseType' => '680',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1369' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1353'
                                                          },
                                                   '1' => {
                                                            'type' => '444'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1375' => {
                                      'Header' => 'util.h',
                                      'Line' => '27',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fn',
                                                           'offset' => '0',
                                                           'type' => '1369'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '514'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_callback',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1502' => {
                                      'BaseType' => '774',
                                      'Name' => 'uint64_t[5]',
                                      'Size' => '40',
                                      'Type' => 'Array'
                                    },
                          '1518' => {
                                      'Header' => 'field_5x52.h',
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'n',
                                                           'offset' => '0',
                                                           'type' => '1502'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_fe',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '1556' => {
                                      'BaseType' => '774',
                                      'Name' => 'uint64_t[4]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '16646' => {
                                       'BaseType' => '3020',
                                       'Name' => 'secp256k1_ecdsa_recoverable_signature const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17351' => {
                                       'BaseType' => '3008',
                                       'Name' => 'secp256k1_ecdsa_recoverable_signature*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '183' => {
                                     'BaseType' => '195',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '63',
                                     'Name' => 'secp256k1_scratch_space',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '1845' => {
                                      'Header' => 'scalar_4x64.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'd',
                                                           'offset' => '0',
                                                           'type' => '1556'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_scalar',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '18609' => {
                                       'BaseType' => '352',
                                       'Name' => 'secp256k1_ecdsa_signature*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '195' => {
                                     'Header' => 'scratch.h',
                                     'Line' => '12',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'magic',
                                                          'offset' => '0',
                                                          'type' => '2149'
                                                        },
                                                 '1' => {
                                                          'name' => 'data',
                                                          'offset' => '8',
                                                          'type' => '444'
                                                        },
                                                 '2' => {
                                                          'name' => 'alloc_size',
                                                          'offset' => '22',
                                                          'type' => '66'
                                                        },
                                                 '3' => {
                                                          'name' => 'max_size',
                                                          'offset' => '36',
                                                          'type' => '66'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_scratch_space_struct',
                                     'PrivateABI' => 1,
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '2049' => {
                                      'Header' => 'group.h',
                                      'Line' => '33',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x',
                                                           'offset' => '0',
                                                           'type' => '1518'
                                                         },
                                                  '1' => {
                                                           'name' => 'y',
                                                           'offset' => '64',
                                                           'type' => '1518'
                                                         },
                                                  '2' => {
                                                           'name' => 'z',
                                                           'offset' => '128',
                                                           'type' => '1518'
                                                         },
                                                  '3' => {
                                                           'name' => 'infinity',
                                                           'offset' => '288',
                                                           'type' => '83'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_gej',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '2149' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '23113' => {
                                       'BaseType' => '11751',
                                       'Name' => 'secp256k1_pubkey const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23247' => {
                                       'BaseType' => '100',
                                       'Name' => 'secp256k1_context*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2390' => {
                                      'BaseType' => '83',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2474' => {
                                      'Header' => 'ecmult_gen.h',
                                      'Line' => '38',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'built',
                                                           'offset' => '0',
                                                           'type' => '83'
                                                         },
                                                  '1' => {
                                                           'name' => 'blind',
                                                           'offset' => '8',
                                                           'type' => '1845'
                                                         },
                                                  '2' => {
                                                           'name' => 'initial',
                                                           'offset' => '64',
                                                           'type' => '2049'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_ecmult_gen_context',
                                      'PrivateABI' => 1,
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '284' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char[64]',
                                     'Size' => '64',
                                     'Type' => 'Array'
                                   },
                          '2856' => {
                                      'BaseType' => '2873',
                                      'Header' => 'secp256k1_ecdh.h',
                                      'Line' => '21',
                                      'Name' => 'secp256k1_ecdh_hash_function',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2868' => {
                                      'BaseType' => '2856',
                                      'Name' => 'secp256k1_ecdh_hash_function const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '2873' => {
                                      'Name' => 'int(*)(unsigned char*, unsigned char const*, unsigned char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '432'
                                                          },
                                                   '1' => {
                                                            'type' => '438'
                                                          },
                                                   '2' => {
                                                            'type' => '438'
                                                          },
                                                   '3' => {
                                                            'type' => '444'
                                                          }
                                                 },
                                      'Return' => '83',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2992' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[65]',
                                      'Size' => '65',
                                      'Type' => 'Array'
                                    },
                          '300' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3008' => {
                                      'Header' => 'secp256k1_recovery.h',
                                      'Line' => '26',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '2992'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_ecdsa_recoverable_signature',
                                      'Size' => '65',
                                      'Type' => 'Struct'
                                    },
                          '3020' => {
                                      'BaseType' => '3008',
                                      'Name' => 'secp256k1_ecdsa_recoverable_signature const',
                                      'Size' => '65',
                                      'Type' => 'Const'
                                    },
                          '3048' => {
                                      'Header' => 'secp256k1_extrakeys.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '284'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_xonly_pubkey',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '3060' => {
                                      'BaseType' => '3048',
                                      'Name' => 'secp256k1_xonly_pubkey const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '307' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '3088' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[96]',
                                      'Size' => '96',
                                      'Type' => 'Array'
                                    },
                          '3104' => {
                                      'Header' => 'secp256k1_extrakeys.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '3088'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_keypair',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '3116' => {
                                      'BaseType' => '3104',
                                      'Name' => 'secp256k1_keypair const',
                                      'Size' => '96',
                                      'Type' => 'Const'
                                    },
                          '312' => {
                                     'Header' => 'secp256k1.h',
                                     'Line' => '76',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '284'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_pubkey',
                                     'Size' => '64',
                                     'Type' => 'Struct'
                                   },
                          '3121' => {
                                      'BaseType' => '3138',
                                      'Header' => 'secp256k1_schnorrsig.h',
                                      'Line' => '41',
                                      'Name' => 'secp256k1_nonce_function_hardened',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3133' => {
                                      'BaseType' => '3121',
                                      'Name' => 'secp256k1_nonce_function_hardened const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '3138' => {
                                      'Name' => 'int(*)(unsigned char*, unsigned char const*, size_t, unsigned char const*, unsigned char const*, unsigned char const*, size_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '432'
                                                          },
                                                   '1' => {
                                                            'type' => '438'
                                                          },
                                                   '2' => {
                                                            'type' => '66'
                                                          },
                                                   '3' => {
                                                            'type' => '438'
                                                          },
                                                   '4' => {
                                                            'type' => '438'
                                                          },
                                                   '5' => {
                                                            'type' => '438'
                                                          },
                                                   '6' => {
                                                            'type' => '66'
                                                          },
                                                   '7' => {
                                                            'type' => '444'
                                                          }
                                                 },
                                      'Return' => '83',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '324' => {
                                     'BaseType' => '312',
                                     'Name' => 'secp256k1_pubkey const',
                                     'Size' => '64',
                                     'Type' => 'Const'
                                   },
                          '3255' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '32571' => {
                                       'BaseType' => '364',
                                       'Name' => 'secp256k1_ecdsa_signature const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3271' => {
                                      'Header' => 'secp256k1_schnorrsig.h',
                                      'Line' => '86',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'magic',
                                                           'offset' => '0',
                                                           'type' => '3255'
                                                         },
                                                  '1' => {
                                                           'name' => 'noncefp',
                                                           'offset' => '8',
                                                           'type' => '3121'
                                                         },
                                                  '2' => {
                                                           'name' => 'ndata',
                                                           'offset' => '22',
                                                           'type' => '444'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_schnorrsig_extraparams',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '33908' => {
                                       'BaseType' => '66',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '352' => {
                                     'Header' => 'secp256k1.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '284'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_ecdsa_signature',
                                     'Size' => '64',
                                     'Type' => 'Struct'
                                   },
                          '364' => {
                                     'BaseType' => '352',
                                     'Name' => 'secp256k1_ecdsa_signature const',
                                     'Size' => '64',
                                     'Type' => 'Const'
                                   },
                          '369' => {
                                     'BaseType' => '386',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '107',
                                     'Name' => 'secp256k1_nonce_function',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '38053' => {
                                       'BaseType' => '183',
                                       'Name' => 'secp256k1_scratch_space*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '381' => {
                                     'BaseType' => '369',
                                     'Name' => 'secp256k1_nonce_function const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '386' => {
                                     'Name' => 'int(*)(unsigned char*, unsigned char const*, unsigned char const*, unsigned char const*, void*, unsigned int)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '432'
                                                         },
                                                  '1' => {
                                                           'type' => '438'
                                                         },
                                                  '2' => {
                                                           'type' => '438'
                                                         },
                                                  '3' => {
                                                           'type' => '438'
                                                         },
                                                  '4' => {
                                                           'type' => '444'
                                                         },
                                                  '5' => {
                                                           'type' => '451'
                                                         }
                                                },
                                     'Return' => '83',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '432' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '438' => {
                                     'BaseType' => '307',
                                     'Name' => 'unsigned char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '444' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '451' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '4666' => {
                                      'BaseType' => '3060',
                                      'Name' => 'secp256k1_xonly_pubkey const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '470' => {
                                     'BaseType' => '112',
                                     'Name' => 'secp256k1_context const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5131' => {
                                      'BaseType' => '3116',
                                      'Name' => 'secp256k1_keypair const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5137' => {
                                      'BaseType' => '3271',
                                      'Name' => 'secp256k1_schnorrsig_extraparams*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '514' => {
                                     'BaseType' => '525',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '52' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '525' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '631' => {
                                     'BaseType' => '52',
                                     'Header' => 'types.h',
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '66' => {
                                    'BaseType' => '52',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'PrivateABI' => 1,
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '673' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '680' => {
                                     'BaseType' => '673',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '774' => {
                                     'BaseType' => '631',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '83' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '9329' => {
                                      'BaseType' => '3104',
                                      'Name' => 'secp256k1_keypair*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9913' => {
                                      'BaseType' => '3048',
                                      'Name' => 'secp256k1_xonly_pubkey*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libsecp256k1.so.1.0.0' => {
                                                               '_ITM_deregisterTMCloneTable' => 0,
                                                               '_ITM_registerTMCloneTable' => 0,
                                                               '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                               '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                               '__gmon_start__' => 0,
                                                               '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                               '__stack_chk_fail@GLIBC_2.4' => 0,
                                                               'abort@GLIBC_2.2.5' => 0,
                                                               'free@GLIBC_2.2.5' => 0,
                                                               'malloc@GLIBC_2.2.5' => 0,
                                                               'memcpy@GLIBC_2.14' => 0,
                                                               'memset@GLIBC_2.2.5' => 0,
                                                               'stderr@GLIBC_2.2.5' => 0
                                                             }
                                },
          'WordSize' => '8'
        };
