$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.3',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.3.0',
          'Headers' => {
                         'secp256k1.h' => 1,
                         'secp256k1_ecdh.h' => 1,
                         'secp256k1_extrakeys.h' => 1,
                         'secp256k1_preallocated.h' => 1,
                         'secp256k1_recovery.h' => 1,
                         'secp256k1_schnorrsig.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libsecp256k1.so.2.0.0',
          'LibraryVersion' => '0.3.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'secp256k1.c' => 1
                       },
          'SymbolInfo' => {
                            '10410' => {
                                         'Header' => 'secp256k1_extrakeys.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx',
                                                               'type' => '466'
                                                             },
                                                      '1' => {

                                                      'secp256k1_ecdsa_recoverable_signature_serialize_compact' => 1,
                                                      'secp256k1_ecdsa_sign' => 1,
                                                      'secp256k1_ecdsa_sign_recoverable' => 1,
                                                      'secp256k1_ecdsa_signature_normalize' => 1,
                                                      'secp256k1_ecdsa_signature_parse_compact' => 1,
                                                      'secp256k1_ecdsa_signature_parse_der' => 1,
                                                      'secp256k1_ecdsa_signature_serialize_compact' => 1,
                                                      'secp256k1_ecdsa_signature_serialize_der' => 1,
                                                      'secp256k1_ecdsa_verify' => 1,
                                                      'secp256k1_keypair_create' => 1,
                                                      'secp256k1_keypair_pub' => 1,
                                                      'secp256k1_keypair_sec' => 1,
                                                      'secp256k1_keypair_xonly_pub' => 1,
                                                      'secp256k1_keypair_xonly_tweak_add' => 1,
                                                      'secp256k1_nonce_function_bip340' => -8,
                                                      'secp256k1_nonce_function_default' => -8,
                                                      'secp256k1_nonce_function_rfc6979' => -8,
                                                      'secp256k1_schnorrsig_sign' => 1,
                                                      'secp256k1_schnorrsig_sign32' => 1,
                                                      'secp256k1_schnorrsig_sign_custom' => 1,
                                                      'secp256k1_schnorrsig_verify' => 1,
                                                      'secp256k1_scratch_space_create' => 1,
                                                      'secp256k1_scratch_space_destroy' => 1,
                                                      'secp256k1_selftest' => 1,
                                                      'secp256k1_tagged_sha256' => 1,
                                                      'secp256k1_xonly_pubkey_cmp' => 1,
                                                      'secp256k1_xonly_pubkey_from_pubkey' => 1,
                                                      'secp256k1_xonly_pubkey_parse' => 1,
                                                      'secp256k1_xonly_pubkey_serialize' => 1,
                                                      'secp256k1_xonly_pubkey_tweak_add' => 1,
                                                      'secp256k1_xonly_pubkey_tweak_add_check' => 1
                                                    }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101' => {
                                     'BaseType' => '118',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '50',
                                     'Name' => 'secp256k1_context',
                                     'Size' => '208',
                                     'Type' => 'Typedef'
                                   },
                          '10405' => {
                                       'BaseType' => '312',
                                       'Name' => 'secp256k1_pubkey*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '113' => {
                                     'BaseType' => '101',
                                     'Name' => 'secp256k1_context const',
                                     'Size' => '208',
                                     'Type' => 'Const'
                                   },
                          '118' => {
                                     'Line' => '60',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'ecmult_gen_ctx',
                                                          'offset' => '0',
                                                          'type' => '2480'
                                                        },
                                                 '1' => {
                                                          'name' => 'illegal_callback',
                                                          'offset' => '360',
                                                          'type' => '1355'
                                                        },
                                                 '2' => {
                                                          'name' => 'error_callback',
                                                          'offset' => '388',
                                                          'type' => '1355'
                                                        },
                                                 '3' => {
                                                          'name' => 'declassify',
                                                          'offset' => '512',
                                                          'type' => '84'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_context_struct',
                                     'PrivateABI' => 1,
                                     'Size' => '208',
                                     'Source' => 'secp256k1.c',
                                     'Type' => 'Struct'
                                   },
                          '11815' => {
                                       'BaseType' => '324',
                                       'Name' => 'secp256k1_pubkey const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11820' => {
                                       'BaseType' => '11815',
                                       'Name' => 'secp256k1_pubkey const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1335' => {
                                      'BaseType' => '669',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1350' => {
                                      'Name' => 'void(*)(char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1335'
                                                          },
                                                   '1' => {
                                                            'type' => '440'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1355' => {
                                      'Header' => 'util.h',
                                      'Line' => '23',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fn',
                                                           'offset' => '0',
                                                           'type' => '1350'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '505'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_callback',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1481' => {
                                      'BaseType' => '763',
                                      'Name' => 'uint64_t[5]',
                                      'Size' => '40',
                                      'Type' => 'Array'
                                    },
                          '1497' => {
                                      'Header' => 'field_5x52.h',
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'n',
                                                           'offset' => '0',
                                                           'type' => '1481'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_fe',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '1534' => {
                                      'BaseType' => '763',
                                      'Name' => 'uint64_t[4]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '16712' => {
                                       'BaseType' => '3017',
                                       'Name' => 'secp256k1_ecdsa_recoverable_signature const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17416' => {
                                       'BaseType' => '3005',
                                       'Name' => 'secp256k1_ecdsa_recoverable_signature*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1819' => {
                                      'Header' => 'scalar_4x64.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'd',
                                                           'offset' => '0',
                                                           'type' => '1534'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_scalar',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '184' => {
                                     'BaseType' => '196',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '63',
                                     'Name' => 'secp256k1_scratch_space',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '18673' => {
                                       'BaseType' => '351',
                                       'Name' => 'secp256k1_ecdsa_signature*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '196' => {
                                     'Header' => 'scratch.h',
                                     'Line' => '12',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'magic',
                                                          'offset' => '0',
                                                          'type' => '2161'
                                                        },
                                                 '1' => {
                                                          'name' => 'data',
                                                          'offset' => '8',
                                                          'type' => '440'
                                                        },
                                                 '2' => {
                                                          'name' => 'alloc_size',
                                                          'offset' => '22',
                                                          'type' => '67'
                                                        },
                                                 '3' => {
                                                          'name' => 'max_size',
                                                          'offset' => '36',
                                                          'type' => '67'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_scratch_space_struct',
                                     'PrivateABI' => 1,
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '2021' => {
                                      'Header' => 'group.h',
                                      'Line' => '33',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x',
                                                           'offset' => '0',
                                                           'type' => '1497'
                                                         },
                                                  '1' => {
                                                           'name' => 'y',
                                                           'offset' => '64',
                                                           'type' => '1497'
                                                         },
                                                  '2' => {
                                                           'name' => 'z',
                                                           'offset' => '128',
                                                           'type' => '1497'
                                                         },
                                                  '3' => {
                                                           'name' => 'infinity',
                                                           'offset' => '288',
                                                           'type' => '84'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_gej',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '2161' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '23172' => {
                                       'BaseType' => '11820',
                                       'Name' => 'secp256k1_pubkey const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23416' => {
                                       'BaseType' => '101',
                                       'Name' => 'secp256k1_context*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2397' => {
                                      'BaseType' => '84',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2480' => {
                                      'Header' => 'ecmult_gen.h',
                                      'Line' => '38',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'built',
                                                           'offset' => '0',
                                                           'type' => '84'
                                                         },
                                                  '1' => {
                                                           'name' => 'blind',
                                                           'offset' => '8',
                                                           'type' => '1819'
                                                         },
                                                  '2' => {
                                                           'name' => 'initial',
                                                           'offset' => '64',
                                                           'type' => '2021'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_ecmult_gen_context',
                                      'PrivateABI' => 1,
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '284' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char[64]',
                                     'Size' => '64',
                                     'Type' => 'Array'
                                   },
                          '2855' => {
                                      'BaseType' => '2872',
                                      'Header' => 'secp256k1_ecdh.h',
                                      'Line' => '21',
                                      'Name' => 'secp256k1_ecdh_hash_function',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2867' => {
                                      'BaseType' => '2855',
                                      'Name' => 'secp256k1_ecdh_hash_function const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '2872' => {
                                      'Name' => 'int(*)(unsigned char*, unsigned char const*, unsigned char const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '430'
                                                          },
                                                   '1' => {
                                                            'type' => '435'
                                                          },
                                                   '2' => {
                                                            'type' => '435'
                                                          },
                                                   '3' => {
                                                            'type' => '440'
                                                          }
                                                 },
                                      'Return' => '84',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2989' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[65]',
                                      'Size' => '65',
                                      'Type' => 'Array'
                                    },
                          '300' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3005' => {
                                      'Header' => 'secp256k1_recovery.h',
                                      'Line' => '26',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '2989'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_ecdsa_recoverable_signature',
                                      'Size' => '65',
                                      'Type' => 'Struct'
                                    },
                          '3017' => {
                                      'BaseType' => '3005',
                                      'Name' => 'secp256k1_ecdsa_recoverable_signature const',
                                      'Size' => '65',
                                      'Type' => 'Const'
                                    },
                          '3044' => {
                                      'Header' => 'secp256k1_extrakeys.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '284'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_xonly_pubkey',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '3056' => {
                                      'BaseType' => '3044',
                                      'Name' => 'secp256k1_xonly_pubkey const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '307' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '3083' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[96]',
                                      'Size' => '96',
                                      'Type' => 'Array'
                                    },
                          '3099' => {
                                      'Header' => 'secp256k1_extrakeys.h',
                                      'Line' => '35',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '3083'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_keypair',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '3111' => {
                                      'BaseType' => '3099',
                                      'Name' => 'secp256k1_keypair const',
                                      'Size' => '96',
                                      'Type' => 'Const'
                                    },
                          '3116' => {
                                      'BaseType' => '3133',
                                      'Header' => 'secp256k1_schnorrsig.h',
                                      'Line' => '41',
                                      'Name' => 'secp256k1_nonce_function_hardened',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '312' => {
                                     'Header' => 'secp256k1.h',
                                     'Line' => '76',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '284'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_pubkey',
                                     'Size' => '64',
                                     'Type' => 'Struct'
                                   },
                          '3128' => {
                                      'BaseType' => '3116',
                                      'Name' => 'secp256k1_nonce_function_hardened const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '3133' => {
                                      'Name' => 'int(*)(unsigned char*, unsigned char const*, size_t, unsigned char const*, unsigned char const*, unsigned char const*, size_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '430'
                                                          },
                                                   '1' => {
                                                            'type' => '435'
                                                          },
                                                   '2' => {
                                                            'type' => '67'
                                                          },
                                                   '3' => {
                                                            'type' => '435'
                                                          },
                                                   '4' => {
                                                            'type' => '435'
                                                          },
                                                   '5' => {
                                                            'type' => '435'
                                                          },
                                                   '6' => {
                                                            'type' => '67'
                                                          },
                                                   '7' => {
                                                            'type' => '440'
                                                          }
                                                 },
                                      'Return' => '84',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '324' => {
                                     'BaseType' => '312',
                                     'Name' => 'secp256k1_pubkey const',
                                     'Size' => '64',
                                     'Type' => 'Const'
                                   },
                          '3248' => {
                                      'BaseType' => '300',
                                      'Name' => 'unsigned char[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '3264' => {
                                      'Header' => 'secp256k1_schnorrsig.h',
                                      'Line' => '86',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'magic',
                                                           'offset' => '0',
                                                           'type' => '3248'
                                                         },
                                                  '1' => {
                                                           'name' => 'noncefp',
                                                           'offset' => '8',
                                                           'type' => '3116'
                                                         },
                                                  '2' => {
                                                           'name' => 'ndata',
                                                           'offset' => '22',
                                                           'type' => '440'
                                                         }
                                                },
                                      'Name' => 'struct secp256k1_schnorrsig_extraparams',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '32716' => {
                                       'BaseType' => '363',
                                       'Name' => 'secp256k1_ecdsa_signature const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34046' => {
                                       'BaseType' => '67',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '351' => {
                                     'Header' => 'secp256k1.h',
                                     'Line' => '89',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '284'
                                                        }
                                               },
                                     'Name' => 'struct secp256k1_ecdsa_signature',
                                     'Size' => '64',
                                     'Type' => 'Struct'
                                   },
                          '363' => {
                                     'BaseType' => '351',
                                     'Name' => 'secp256k1_ecdsa_signature const',
                                     'Size' => '64',
                                     'Type' => 'Const'
                                   },
                          '368' => {
                                     'BaseType' => '385',
                                     'Header' => 'secp256k1.h',
                                     'Line' => '107',
                                     'Name' => 'secp256k1_nonce_function',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '380' => {
                                     'BaseType' => '368',
                                     'Name' => 'secp256k1_nonce_function const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '38190' => {
                                       'BaseType' => '184',
                                       'Name' => 'secp256k1_scratch_space*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '385' => {
                                     'Name' => 'int(*)(unsigned char*, unsigned char const*, unsigned char const*, unsigned char const*, void*, unsigned int)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '430'
                                                         },
                                                  '1' => {
                                                           'type' => '435'
                                                         },
                                                  '2' => {
                                                           'type' => '435'
                                                         },
                                                  '3' => {
                                                           'type' => '435'
                                                         },
                                                  '4' => {
                                                           'type' => '440'
                                                         },
                                                  '5' => {
                                                           'type' => '447'
                                                         }
                                                },
                                     'Return' => '84',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '430' => {
                                     'BaseType' => '300',
                                     'Name' => 'unsigned char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '435' => {
                                     'BaseType' => '307',
                                     'Name' => 'unsigned char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '440' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '447' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '466' => {
                                     'BaseType' => '113',
                                     'Name' => 'secp256k1_context const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '4743' => {
                                      'BaseType' => '3056',
                                      'Name' => 'secp256k1_xonly_pubkey const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '505' => {
                                     'BaseType' => '515',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '515' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '5207' => {
                                      'BaseType' => '3111',
                                      'Name' => 'secp256k1_keypair const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5212' => {
                                      'BaseType' => '3264',
                                      'Name' => 'secp256k1_schnorrsig_extraparams*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '53' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '621' => {
                                     'BaseType' => '53',
                                     'Header' => 'types.h',
                                     'Line' => '45',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '662' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '669' => {
                                     'BaseType' => '662',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '67' => {
                                    'BaseType' => '53',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'PrivateABI' => 1,
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '763' => {
                                     'BaseType' => '621',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '84' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '9402' => {
                                      'BaseType' => '3099',
                                      'Name' => 'secp256k1_keypair*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9985' => {
                                      'BaseType' => '3044',
                                      'Name' => 'secp256k1_xonly_pubkey*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libsecp256k1.so.2.0.0' => {
                                                               '_ITM_deregisterTMCloneTable' => 0,
                                                               '_ITM_registerTMCloneTable' => 0,
                                                               '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                               '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                               '__gmon_start__' => 0,
                                                               '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                               '__stack_chk_fail@GLIBC_2.4' => 0,
                                                               'abort@GLIBC_2.2.5' => 0,
                                                               'free@GLIBC_2.2.5' => 0,
                                                               'malloc@GLIBC_2.2.5' => 0,
                                                               'memcpy@GLIBC_2.14' => 0,
                                                               'memset@GLIBC_2.2.5' => 0,
                                                               'stderr@GLIBC_2.2.5' => 0
                                                             }
                                },
          'WordSize' => '8'
        };
